# Практическая работа 4

## Задание №1

In [1]:
import numpy as np
from scipy.stats import skew,kurtosis
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [2]:
norm_data=np.random.normal(size=1000)
exp_data=np.random.exponential(size=1000)
un_data=np.random.uniform(size=1000)
geom_data=np.random.geometric(0.5,size=1000)

In [3]:
def get_stats(data: np.ndarray):
    data_min=data.min()
    data_max=data.max()
    data_mean=data.mean()
    data_var=data.var()
    data_std=data.std()
    data_quart=np.percentile(data,25)
    data_sevfiv=np.percentile(data,75)
    data_step=data_max-data_min
    data_median=np.median(data)
    data_skew=skew(data)
    data_kurtosis=kurtosis(data)
    return [data_min,data_max,data_mean,data_var,data_std,data_quart,data_sevfiv,data_step,data_median,data_skew,data_kurtosis]
    
    
numpy_df=[get_stats(norm_data),get_stats(exp_data),get_stats(un_data),get_stats(geom_data)]
#print(numpy_df)
numpy_df=np.concatenate(numpy_df).reshape(4,11)

In [4]:
numpy_df

array([[-3.41133359e+00,  3.43030814e+00, -4.35371623e-02,
         1.00321989e+00,  1.00160865e+00, -7.03568879e-01,
         6.38135419e-01,  6.84164173e+00,  1.83438411e-02,
        -1.41798832e-01,  2.34899027e-01],
       [ 7.81026916e-06,  7.27981580e+00,  9.99058430e-01,
         9.79090115e-01,  9.89489826e-01,  2.95521583e-01,
         1.36970751e+00,  7.27980799e+00,  7.15971819e-01,
         1.88442102e+00,  4.85191718e+00],
       [ 8.46970147e-04,  9.97274195e-01,  4.87075410e-01,
         8.34897290e-02,  2.88945893e-01,  2.36826115e-01,
         7.42530183e-01,  9.96427225e-01,  4.84346723e-01,
         3.41192216e-02, -1.23266437e+00],
       [ 1.00000000e+00,  1.30000000e+01,  2.14200000e+00,
         2.46583600e+00,  1.57029806e+00,  1.00000000e+00,
         3.00000000e+00,  1.20000000e+01,  2.00000000e+00,
         2.12770742e+00,  6.51124809e+00]])

In [5]:
df=pd.DataFrame(numpy_df)
df=df.rename(columns={
    0:'Минимум',1:'Максимум',2:'Среднее',3:'Дисперсия',4:"СКО",5:'25% перцентиль',6:'75% перцентиль',
    7:"Размах",8:"Медиана",9:"Коеф. асимметрии",10:'Коеф. экцесса'
                     },index={0:'Нормальное',1:'Экспонинциальное',2:'Равномерное',3:'Геометрическое'})
df

,Минимум,Максимум,Среднее,Дисперсия,СКО,25% перцентиль,75% перцентиль,Размах,Медиана,Коеф. асимметрии,Коеф. экцесса
Нормальное,-3.411334,3.430308,-0.043537,1.003220,1.001609,-0.703569,0.638135,6.841642,0.018344,-0.141799,0.234899
Экспонинциальное,0.000008,7.279816,0.999058,0.979090,0.989490,0.295522,1.369708,7.279808,0.715972,1.884421,4.851917
Равномерное,0.000847,0.997274,0.487075,0.083490,0.288946,0.236826,0.742530,0.996427,0.484347,0.034119,-1.232664
Геометрическое,1.000000,13.000000,2.142000,2.465836,1.570298,1.000000,3.000000,12.000000,2.000000,2.127707,6.511248

In [8]:
df.

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Нормальное to Геометрическое
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Минимум           4 non-null      float64
 1   Максимум          4 non-null      float64
 2   Среднее           4 non-null      float64
 3   Дисперсия         4 non-null      float64
 4   СКО               4 non-null      float64
 5   25% перцентиль    4 non-null      float64
 6   75% перцентиль    4 non-null      float64
 7   Размах            4 non-null      float64
 8   Медиана           4 non-null      float64
 9   Коеф. асимметрии  4 non-null      float64
 10  Коеф. экцесса     4 non-null      float64
dtypes: float64(11)
memory usage: 384.0+ bytes

In [6]:
df.to_csv('task_1.csv',index=True)

## Задание №2

In [7]:
data=pd.read_csv(r'titanic.csv')

In [26]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [31]:
data=data.set_index('PassengerId')
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [33]:
lb=LabelEncoder()
data['Sex']=lb.fit_transform(data['Sex'])
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",1,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",0,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",1,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",1,32.0,0,0,370376,7.7500,NaN,Q